# 1 - Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
letra = ['A','B','C']
numero = [10, 20, 30]
arrey = np.array([10, 20, 30])
dicionario = {'A':10, 'B':20, 'C':30}

In [3]:
pd.Series(letra)

0    A
1    B
2    C
dtype: object

In [4]:
pd.Series(data=letra, index=numero)

10    A
20    B
30    C
dtype: object

In [5]:
dicionario

{'A': 10, 'B': 20, 'C': 30}

In [6]:
pd.Series(dicionario)

A    10
B    20
C    30
dtype: int64

In [7]:
serie1 = pd.Series([1,2,3,4], index=["Brasil", "Japão", "Russia", "EUA"])
serie1

Brasil    1
Japão     2
Russia    3
EUA       4
dtype: int64

In [8]:
serie2 = pd.Series([1,4,8,0], index=["Brasil", "Japão", "URSS", "EUA"])
serie2

Brasil    1
Japão     4
URSS      8
EUA       0
dtype: int64

In [9]:
serie1["Japão"]

2

In [10]:
serie2[["URSS", "EUA"]]

URSS    8
EUA     0
dtype: int64

In [11]:
serie1 + serie2

Brasil    2.0
EUA       4.0
Japão     6.0
Russia    NaN
URSS      NaN
dtype: float64

# 2 - DataFrames

In [12]:
from numpy.random import randn

In [13]:
df = pd.DataFrame(randn(5, 4), index="A B C D E".split(), columns="W X Y Z".split())
df

          W         X         Y         Z
A -0.195864 -0.933915  0.567305 -1.468539
B  0.700845 -0.384970  0.255288 -0.008149
C  0.247221  0.696932  0.976196  0.544554
D  1.043051  1.455276 -0.954182 -0.144698
E -1.774357  0.595855 -1.001516 -1.702374

In [14]:
df["W"]

A   -0.195864
B    0.700845
C    0.247221
D    1.043051
E   -1.774357
Name: W, dtype: float64

In [15]:
type(df["W"])

pandas.core.series.Series

In [16]:
df[["W", "Z"]]

          W         Z
A -0.195864 -1.468539
B  0.700845 -0.008149
C  0.247221  0.544554
D  1.043051 -0.144698
E -1.774357 -1.702374

## Criar nova coluna POREM copiando os dados de outra coluna

In [17]:
df["Novo"] = df["W"]
df

          W         X         Y         Z      Novo
A -0.195864 -0.933915  0.567305 -1.468539 -0.195864
B  0.700845 -0.384970  0.255288 -0.008149  0.700845
C  0.247221  0.696932  0.976196  0.544554  0.247221
D  1.043051  1.455276 -0.954182 -0.144698  1.043051
E -1.774357  0.595855 -1.001516 -1.702374 -1.774357

In [18]:
del df["Novo"]
df

          W         X         Y         Z
A -0.195864 -0.933915  0.567305 -1.468539
B  0.700845 -0.384970  0.255288 -0.008149
C  0.247221  0.696932  0.976196  0.544554
D  1.043051  1.455276 -0.954182 -0.144698
E -1.774357  0.595855 -1.001516 -1.702374

In [19]:
df["Novo"] = df["W"]
df.drop('Novo', axis=1)
# Opção sem Retorno
df.drop('Novo', axis=1, inplace=True)

In [20]:
df.loc["A"]

W   -0.195864
X   -0.933915
Y    0.567305
Z   -1.468539
Name: A, dtype: float64

In [21]:
df.loc[["A", "C", "E"]]

          W         X         Y         Z
A -0.195864 -0.933915  0.567305 -1.468539
C  0.247221  0.696932  0.976196  0.544554
E -1.774357  0.595855 -1.001516 -1.702374

In [22]:
df.iloc[0,2]

0.5673051677503976

# 3 - Filtros

In [23]:
df

          W         X         Y         Z
A -0.195864 -0.933915  0.567305 -1.468539
B  0.700845 -0.384970  0.255288 -0.008149
C  0.247221  0.696932  0.976196  0.544554
D  1.043051  1.455276 -0.954182 -0.144698
E -1.774357  0.595855 -1.001516 -1.702374

In [24]:
df.loc[["A","B"], "Z"]

A   -1.468539
B   -0.008149
Name: Z, dtype: float64

In [25]:
df.loc[["A","B"], ["Z"]]

          Z
A -1.468539
B -0.008149

In [26]:
df.iloc[:-3, 3:]

          Z
A -1.468539
B -0.008149

In [27]:
df.iloc[1:4, 1:3]

          X         Y
B -0.384970  0.255288
C  0.696932  0.976196
D  1.455276 -0.954182

In [28]:
df

          W         X         Y         Z
A -0.195864 -0.933915  0.567305 -1.468539
B  0.700845 -0.384970  0.255288 -0.008149
C  0.247221  0.696932  0.976196  0.544554
D  1.043051  1.455276 -0.954182 -0.144698
E -1.774357  0.595855 -1.001516 -1.702374

In [29]:
df + df

          W         X         Y         Z
A -0.391729 -1.867831  1.134610 -2.937077
B  1.401690 -0.769940  0.510576 -0.016298
C  0.494441  1.393865  1.952391  1.089109
D  2.086102  2.910551 -1.908364 -0.289396
E -3.548714  1.191711 -2.003032 -3.404748

In [30]:
df > 0

       W      X      Y      Z
A  False  False   True  False
B   True  False   True  False
C   True   True   True   True
D   True   True  False  False
E  False   True  False  False

In [31]:
df[df > 0]

          W         X         Y         Z
A       NaN       NaN  0.567305       NaN
B  0.700845       NaN  0.255288       NaN
C  0.247221  0.696932  0.976196  0.544554
D  1.043051  1.455276       NaN       NaN
E       NaN  0.595855       NaN       NaN

In [32]:
df[df["Y"] > 0]

          W         X         Y         Z
A -0.195864 -0.933915  0.567305 -1.468539
B  0.700845 -0.384970  0.255288 -0.008149
C  0.247221  0.696932  0.976196  0.544554

In [33]:
df[( df["Y"] > 0) & (df["W"] > 0 )]

          W         X         Y         Z
B  0.700845 -0.384970  0.255288 -0.008149
C  0.247221  0.696932  0.976196  0.544554

In [34]:
( df["Y"] > 0) & (df["W"] > 0 )

A    False
B     True
C     True
D    False
E    False
dtype: bool

# 4 - Índices

In [35]:
df

          W         X         Y         Z
A -0.195864 -0.933915  0.567305 -1.468539
B  0.700845 -0.384970  0.255288 -0.008149
C  0.247221  0.696932  0.976196  0.544554
D  1.043051  1.455276 -0.954182 -0.144698
E -1.774357  0.595855 -1.001516 -1.702374

In [36]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [37]:
df.reset_index()
df.reset_index(inplace=True)

In [38]:
df

  index         W         X         Y         Z
0     A -0.195864 -0.933915  0.567305 -1.468539
1     B  0.700845 -0.384970  0.255288 -0.008149
2     C  0.247221  0.696932  0.976196  0.544554
3     D  1.043051  1.455276 -0.954182 -0.144698
4     E -1.774357  0.595855 -1.001516 -1.702374

In [39]:
df.set_index("index", inplace=True)
df

              W         X         Y         Z
index
A     -0.195864 -0.933915  0.567305 -1.468539
B      0.700845 -0.384970  0.255288 -0.008149
C      0.247221  0.696932  0.976196  0.544554
D      1.043051  1.455276 -0.954182 -0.144698
E     -1.774357  0.595855 -1.001516 -1.702374

In [40]:
indexNovo = "DF GO SP RJ RN".split()
df["novo_index"] = indexNovo
df

              W         X         Y         Z novo_index
index
A     -0.195864 -0.933915  0.567305 -1.468539         DF
B      0.700845 -0.384970  0.255288 -0.008149         GO
C      0.247221  0.696932  0.976196  0.544554         SP
D      1.043051  1.455276 -0.954182 -0.144698         RJ
E     -1.774357  0.595855 -1.001516 -1.702374         RN

In [41]:
df.set_index("novo_index", inplace=True)
df

                   W         X         Y         Z
novo_index
DF         -0.195864 -0.933915  0.567305 -1.468539
GO          0.700845 -0.384970  0.255288 -0.008149
SP          0.247221  0.696932  0.976196  0.544554
RJ          1.043051  1.455276 -0.954182 -0.144698
RN         -1.774357  0.595855 -1.001516 -1.702374

In [42]:
df.reset_index().set_index("novo_index")
df

                   W         X         Y         Z
novo_index
DF         -0.195864 -0.933915  0.567305 -1.468539
GO          0.700845 -0.384970  0.255288 -0.008149
SP          0.247221  0.696932  0.976196  0.544554
RJ          1.043051  1.455276 -0.954182 -0.144698
RN         -1.774357  0.595855 -1.001516 -1.702374

# 5 - Hierarquia & Índices Multiplos

In [44]:
fora = "G1 G1 G1 G2 G2 G2".split()
dentro = [1,2,3, 1,2,3]
hierarkia_index = list(zip(fora, dentro))
hierarkia_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [45]:
hierarkia_index = pd.MultiIndex.from_tuples(hierarkia_index)
hierarkia_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [46]:
df = pd.DataFrame(np.random.randn(6, 2), index=hierarkia_index, columns=["A","B"])
df

             A         B
G1 1 -0.053293 -0.788911
   2  0.196768  0.690200
   3 -1.501897  1.832460
G2 1 -0.307193  2.160152
   2  0.261989  0.113054
   3 -0.639691  1.179473

In [48]:
df.loc["G1"]

          A         B
1 -0.053293 -0.788911
2  0.196768  0.690200
3 -1.501897  1.832460

In [52]:
df.loc["G1"].loc[1]

A   -0.053293
B   -0.788911
Name: 1, dtype: float64

In [53]:
df.index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [55]:
df.index.names

FrozenList([None, None])

In [56]:
df.index.names=["Grupo", "Numero"]
df

                     A         B
Grupo Numero
G1    1      -0.053293 -0.788911
      2       0.196768  0.690200
      3      -1.501897  1.832460
G2    1      -0.307193  2.160152
      2       0.261989  0.113054
      3      -0.639691  1.179473

In [58]:
df.xs("G1")

               A         B
Numero
1      -0.053293 -0.788911
2       0.196768  0.690200
3      -1.501897  1.832460

In [69]:
df.xs(1, level="Numero")

              A         B
Grupo
G1    -0.053293 -0.788911
G2    -0.307193  2.160152

In [70]:
df.xs(2, level="Numero")

              A         B
Grupo
G1     0.196768  0.690200
G2     0.261989  0.113054

In [71]:
df.xs(3, level="Numero")

              A         B
Grupo
G1    -1.501897  1.832460
G2    -0.639691  1.179473

# 6 - Dados Ausentes

In [72]:
df = pd.DataFrame({
    "A" : [1, 2, np.nan],
    "B" : [4, np.nan, np.nan],
    "C" : [7, 1, 3] 
})
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  1
2  NaN  NaN  3

In [77]:
df.dropna(axis=0)

     A    B  C
0  1.0  4.0  7

In [80]:
df.dropna(axis=1)

   C
0  7
1  1
2  3

In [83]:
df.dropna(axis=1, thresh=3)

   C
0  7
1  1
2  3

In [84]:
df.dropna(axis=1, thresh=2)

     A  C
0  1.0  7
1  2.0  1
2  NaN  3

In [85]:
df.dropna(axis=1, thresh=1)

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  1
2  NaN  NaN  3

In [86]:
df.dropna(axis=0, thresh=3)

     A    B  C
0  1.0  4.0  7

In [87]:
df.dropna(axis=0, thresh=2)

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  1

In [88]:
df.dropna(axis=0, thresh=1)

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  1
2  NaN  NaN  3

In [91]:
df.fillna("TEXTANDO")

          A         B  C
0       1.0       4.0  7
1       2.0  TEXTANDO  1
2  TEXTANDO  TEXTANDO  3

In [92]:
df.fillna(0)

     A    B  C
0  1.0  4.0  7
1  2.0  0.0  1
2  0.0  0.0  3

In [95]:
df["B"].fillna("b")

0    4.0
1      b
2      b
Name: B, dtype: object

In [96]:
df.ffill()

     A    B  C
0  1.0  4.0  7
1  2.0  4.0  1
2  2.0  4.0  3

# 7 - Groupby